In [1]:
import pandas as pd
df1 = pd.DataFrame([[1,2,3],[4,5,6]])
df2 = pd.DataFrame([[2,4,6],[8,10,12]])

df1+df2

    0   1   2
0   3   6   9
1  12  15  18

In [2]:
df1/df2

     0    1    2
0  0.5  0.5  0.5
1  0.5  0.5  0.5

In [3]:
df1-df2

   0  1  2
0 -1 -2 -3
1 -4 -5 -6

In [4]:
df1*df2

    0   1   2
0   2   8  18
1  32  50  72

In [5]:
df1.sub(df2)

   0  1  2
0 -1 -2 -3
1 -4 -5 -6

In [6]:
df1.rsub(df2)

   0  1  2
0  1  2  3
1  4  5  6

In [7]:
df1.rdiv(df2)

     0    1    2
0  2.0  2.0  2.0
1  2.0  2.0  2.0

In [ ]:
# is trh se araam se binary operations perform kiay jaasktay hain DataFrames main..